package Level_2;

// 프로그래머스 Lv.2
// 멀쩡한 사각형
// https://school.programmers.co.kr/learn/courses/30/lessons/62048?language=java
public class no_62048 {
/*
대각선으로 잘랐을 때, 영역이 나누어지는 부분을 체크

체크 되지 않은 부분의 개수를 반환
 */
    public long solution(int w, int h){
        long answer = (long) w * h;

        if(w == h){ // 1. w 와 h 가 같음
            answer -= w;
        } else if(w%2 == 0 && h%2 == 0){    // w 쩍수, h 짝수
            answer = (answer-2*w);
        } else if(w%2 == 0 && h%2 != 0){    // w 짝수, h 홀수
            answer = answer - 2 - 2*(h-2);
        } else if(w%2 != 0 && h%2 == 0) { // w 홀수, h 짝수
            answer = answer - 2 - 2 * (h - 2);
        } else {    // w 홀수, h 홀수
            answer = answer - 3 - 2*(h-3);
        }
        return answer;
    }

    public static void main(String[] args){
        // 가로
        int W = 8;
        // 세로
        int H = 12;
        // result = 80 (w + w) => 96 - 16 = 80
        no_62048 problem = new no_62048();
        System.out.println(problem.solution(W,H));
    }
}

/*
w : 3, h : 3
0 0 0       1 0 0
0 0 0   =>  0 1 0
0 0 0       0 0 1
=> 3 ( w || h )
w : 4, h : 3
0 0 0 0     1 0 0 0
0 0 0 0  => 0 1 1 0
0 0 0 0     0 0 0 1
=> 4 ( w || h + (h-2) )
w : 3, h : 4
0 0 0       1 0 0
0 0 0       1 1 0
0 0 0   =>  0 1 1
0 0 0       0 0 1
=> 6 ( 2w )
w : 4, h : 4
0 0 0 0     1 0 0 0
0 0 0 0     0 1 0 0
0 0 0 0  => 0 0 1 0
0 0 0 0     0 0 0 1
=> 4
w : 5, h : 4
0 0 0 0 0    1 0 0 0 0
0 0 0 0 0    0 1 1 0 0
0 0 0 0 0 => 0 0 1 1 0
0 0 0 0 0    0 0 0 0 1
=> 6 (4 + 4-2)
w : 4, h : 5
0 0 0 0     1 0 0 0
0 0 0 0     1 1 0 0
0 0 0 0 =>  0 1 1 0
0 0 0 0     0 0 1 1
0 0 0 0     0 0 0 1
=> 8 ( 2*4 )
w : 5, h : 5
0 0 0 0 0   1 0 0 0 0
0 0 0 0 0   0 1 0 0 0
0 0 0 0 0   0 0 1 0 0
0 0 0 0 0   0 0 0 1 0
0 0 0 0 0   0 0 0 0 1
=> 5
w : 5, h : 6
0 0 0 0 0   1 0 0 0 0
0 0 0 0 0   1 1 0 0 0
0 0 0 0 0   0 1 1 0 0
0 0 0 0 0   0 0 1 1 0
0 0 0 0 0   0 0 0 1 1
0 0 0 0 0   0 0 0 0 1
=> w 홀수, h 짝수
=> 1칸짜리 2, 2 + 2*(h-2) => 2 + 8 = 10
=> 10 ( 2*5 )
w : 6, h: 5
0 0 0 0 0 0     1 0 0 0 0 0
0 0 0 0 0 0     0 1 1 0 0 0
0 0 0 0 0 0     0 0 1 1 0 0
0 0 0 0 0 0     0 0 0 1 1 0
0 0 0 0 0 0     0 0 0 0 0 1
=> w 짝수, h 홀수
=> 8 ( h + h-2 )
=> 1 칸 짜리 2개, 2*(5-2) + 2 : 8
w : 5, h : 7
0 0 0 0 0   1 0 0 0 0
0 0 0 0 0   1 1 0 0 0
0 0 0 0 0   0 1 1 0 0
0 0 0 0 0   0 0 1 0 0
0 0 0 0 0   0 0 1 1 0
0 0 0 0 0   0 0 0 1 1
0 0 0 0 0   0 0 0 0 1
=> h 가 홀수, w 도 홀수
=> 1 칸 짜리 3, 2 * ( 7 - 3 ) + 3 : 8 + 3 = 11
w : 6, h : 8
0 0 0 0 0 0
0 0 0 0 0 0
0 0 0 0 0 0
0 0 0 0 0 0
0 0 0 0 0 0
0 0 0 0 0 0
0 0 0 0 0 0
0 0 0 0 0 0
 */
